In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [2]:
pd.Series()

Series([], dtype: float64)

In [3]:
name=["Animesh","Ajay","Omkar","Prathm","Harsh"]

In [4]:
pd.Series(name)

0    Animesh
1       Ajay
2      Omkar
3     Prathm
4      Harsh
dtype: object

In [6]:
type(name)

list

In [8]:
s=pd.Series(data=name,index=["a","b","c","d","e"])
s

a    Animesh
b       Ajay
c      Omkar
d     Prathm
e      Harsh
dtype: object

In [9]:
s["b"]

'Ajay'

In [10]:
d={
    "a":"Navya",
    "b":"Harry",
    "c":"Mani",
    "d":"Raj",
    "e":"Nisha"
}

In [12]:
s=pd.Series(d)
s

a    Navya
b    Harry
c     Mani
d      Raj
e    Nisha
dtype: object

In [13]:
name

['Animesh', 'Ajay', 'Omkar', 'Prathm', 'Harsh']

In [14]:
pd.DataFrame(name)

         0
0  Animesh
1     Ajay
2    Omkar
3   Prathm
4    Harsh

# DataFrame
Name
Python
MachineLearning

In [22]:
data=[
    ["Prateek",89,90],
    ["Nishant",78,59],
    ["Jay",75,89],
    ["Sandesh",89,78],
    ["Raj",89,76],
]

In [21]:
col=["Name","Python","MachineLearning"]
df=pd.DataFrame(data,columns=col)
df

      Name  Python  MachineLearning
0  Prateek      89               90
1  Nishant      78               59
2      Jay      75               89
3  Sandesh      89               78
4      Raj      89               76

In [24]:
data={
    "Name":["Prateek","Harry","Shree","Puja","Nitin"],
    "Python":[89,78,75,89,89],
    "MachineLearning":[98,76,89,78,97]
}

In [29]:
df=pd.DataFrame(data)
df

      Name  Python  MachineLearning
0  Prateek      89               98
1    Harry      78               76
2    Shree      75               89
3     Puja      89               78
4    Nitin      89               97

In [30]:
df.Name=="Shree"

0    False
1    False
2     True
3    False
4    False
Name: Name, dtype: bool

In [31]:
df[df.Name=="Shree"]

    Name  Python  MachineLearning
2  Shree      75               89

In [32]:
data={
    "Name":["Prateek","Harry","Shree","Puja","Nitin"],
    "Python":[89,78,75,89,89],
    "MachineLearning":[98,76,89,78,97]
}
df=pd.DataFrame(data,index=["rank1","rank2","rank3","rank4","rank5"])
df

          Name  Python  MachineLearning
rank1  Prateek      89               98
rank2    Harry      78               76
rank3    Shree      75               89
rank4     Puja      89               78
rank5    Nitin      89               97

In [33]:
np.random.randn(10, 4)

array([[-0.90456048,  0.76661285,  0.12673309,  1.76797917],
       [-0.21653703,  0.17224289,  0.8886072 ,  0.24663555],
       [ 1.04579132,  0.27110466,  0.41670859,  0.75678623],
       [-0.77028325, -1.20399045, -1.85109569,  0.18749438],
       [-0.32500447, -2.26867271, -0.8890595 ,  0.1245908 ],
       [ 0.05473149, -0.02753522,  0.60365688, -1.55707587],
       [-1.33204446, -0.0296846 ,  1.02442708,  1.54541673],
       [ 2.21064387, -0.03841779,  1.28499585, -0.16898576],
       [-0.30971831, -0.85090402,  0.08106407, -0.3269137 ],
       [ 0.74554598,  0.23463882,  2.17585109,  1.65102465]])

In [36]:
d=np.random.randn(10, 4)
df=pd.DataFrame(d,columns=["A","B","C","D"])
df

          A         B         C         D
0  0.190547  0.492686  1.577484  1.306524
1  0.127527 -1.407634  1.492629 -0.700919
2  1.449884  0.429507 -0.727357  0.626302
3  1.508036  0.145750  1.219117  0.279425
4  0.513101 -0.967373  0.346074  0.868721
5  0.286669  1.415355  0.351467 -0.742251
6  1.858368 -1.806185  0.028666  0.808293
7 -0.707227  0.390503 -0.540637  1.002350
8 -0.237853 -0.143925  1.003050  1.227861
9  0.688885  0.237755 -0.223728 -0.028453

In [37]:
df.to_csv("random2.csv",index=False)

In [39]:
import pandas as pd
from google.colab import files
uploaded = files.upload()

NameError: name 'files' is not defined